AdrianoRuseler/LAUNCHXL-F28377S/C2000Ware/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPAINV register
//
//*****************************************************************************
#define GPIO_GPAINV_GPIO0         0x1         // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO1         0x2         // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO2         0x4         // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO3         0x8         // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO4         0x10        // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO5         0x20        // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO6         0x40        // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO7         0x80        // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO8         0x100       // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO9         0x200       // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO10        0x400       // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO11        0x800       // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO12        0x1000      // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO13        0x2000      // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO14        0x4000      // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO15        0x8000      // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO16        0x10000     // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO17        0x20000     // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO18        0x40000     // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO19        0x80000     // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO20        0x100000    // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO21        0x200000    // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO22        0x400000    // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO23        0x800000    // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO24        0x1000000   // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO25        0x2000000   // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO26        0x4000000   // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO27        0x8000000   // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO28        0x10000000  // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO29        0x20000000  // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO30        0x40000000  // Input inversion control for
                                              // this pin
#define GPIO_GPAINV_GPIO31        0x80000000  // Input inversion control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPAODR register
//
//*****************************************************************************
#define GPIO_GPAODR_GPIO0         0x1         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO1         0x2         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO2         0x4         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO3         0x8         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO4         0x10        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO5         0x20        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO6         0x40        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO7         0x80        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO8         0x100       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO9         0x200       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO10        0x400       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO11        0x800       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO12        0x1000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO13        0x2000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO14        0x4000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO15        0x8000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO16        0x10000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO17        0x20000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO18        0x40000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO19        0x80000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO20        0x100000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO21        0x200000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO22        0x400000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO23        0x800000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO24        0x1000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO25        0x2000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO26        0x4000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO27        0x8000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO28        0x10000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO29        0x20000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO30        0x40000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPAODR_GPIO31        0x80000000  // Outpout Open-Drain control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPAGMUX1 register
//
//*****************************************************************************
#define GPIO_GPAGMUX1_GPIO0_S     0
#define GPIO_GPAGMUX1_GPIO0_M     0x3         // Defines pin-muxing selection
                                              // for GPIO0
#define GPIO_GPAGMUX1_GPIO1_S     2
#define GPIO_GPAGMUX1_GPIO1_M     0xC         // Defines pin-muxing selection
                                              // for GPIO1
#define GPIO_GPAGMUX1_GPIO2_S     4
#define GPIO_GPAGMUX1_GPIO2_M     0x30        // Defines pin-muxing selection
                                              // for GPIO2
#define GPIO_GPAGMUX1_GPIO3_S     6
#define GPIO_GPAGMUX1_GPIO3_M     0xC0        // Defines pin-muxing selection
                                              // for GPIO3
#define GPIO_GPAGMUX1_GPIO4_S     8
#define GPIO_GPAGMUX1_GPIO4_M     0x300       // Defines pin-muxing selection
                                              // for GPIO4
#define GPIO_GPAGMUX1_GPIO5_S     10
#define GPIO_GPAGMUX1_GPIO5_M     0xC00       // Defines pin-muxing selection
                                              // for GPIO5
#define GPIO_GPAGMUX1_GPIO6_S     12
#define GPIO_GPAGMUX1_GPIO6_M     0x3000      // Defines pin-muxing selection
                                              // for GPIO6
#define GPIO_GPAGMUX1_GPIO7_S     14
#define GPIO_GPAGMUX1_GPIO7_M     0xC000      // Defines pin-muxing selection
                                              // for GPIO7
#define GPIO_GPAGMUX1_GPIO8_S     16
#define GPIO_GPAGMUX1_GPIO8_M     0x30000     // Defines pin-muxing selection
                                              // for GPIO8
#define GPIO_GPAGMUX1_GPIO9_S     18
#define GPIO_GPAGMUX1_GPIO9_M     0xC0000     // Defines pin-muxing selection
                                              // for GPIO9
#define GPIO_GPAGMUX1_GPIO10_S    20
#define GPIO_GPAGMUX1_GPIO10_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO10
#define GPIO_GPAGMUX1_GPIO11_S    22
#define GPIO_GPAGMUX1_GPIO11_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO11
#define GPIO_GPAGMUX1_GPIO12_S    24
#define GPIO_GPAGMUX1_GPIO12_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO12
#define GPIO_GPAGMUX1_GPIO13_S    26
#define GPIO_GPAGMUX1_GPIO13_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO13
#define GPIO_GPAGMUX1_GPIO14_S    28
#define GPIO_GPAGMUX1_GPIO14_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO14
#define GPIO_GPAGMUX1_GPIO15_S    30
#define GPIO_GPAGMUX1_GPIO15_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO15

//*****************************************************************************
//
// The following are defines for the bit fields in the GPAGMUX2 register
//
//*****************************************************************************
#define GPIO_GPAGMUX2_GPIO16_S    0
#define GPIO_GPAGMUX2_GPIO16_M    0x3         // Defines pin-muxing selection
                                              // for GPIO16
#define GPIO_GPAGMUX2_GPIO17_S    2
#define GPIO_GPAGMUX2_GPIO17_M    0xC         // Defines pin-muxing selection
                                              // for GPIO17
#define GPIO_GPAGMUX2_GPIO18_S    4
#define GPIO_GPAGMUX2_GPIO18_M    0x30        // Defines pin-muxing selection
                                              // for GPIO18
#define GPIO_GPAGMUX2_GPIO19_S    6
#define GPIO_GPAGMUX2_GPIO19_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO19
#define GPIO_GPAGMUX2_GPIO20_S    8
#define GPIO_GPAGMUX2_GPIO20_M    0x300       // Defines pin-muxing selection
                                              // for GPIO20
#define GPIO_GPAGMUX2_GPIO21_S    10
#define GPIO_GPAGMUX2_GPIO21_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO21
#define GPIO_GPAGMUX2_GPIO22_S    12
#define GPIO_GPAGMUX2_GPIO22_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO22
#define GPIO_GPAGMUX2_GPIO23_S    14
#define GPIO_GPAGMUX2_GPIO23_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO23
#define GPIO_GPAGMUX2_GPIO24_S    16
#define GPIO_GPAGMUX2_GPIO24_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO24
#define GPIO_GPAGMUX2_GPIO25_S    18
#define GPIO_GPAGMUX2_GPIO25_M    0xC0000     // Defines pin-muxing selection
                                              // for GPIO25
#define GPIO_GPAGMUX2_GPIO26_S    20
#define GPIO_GPAGMUX2_GPIO26_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO26
#define GPIO_GPAGMUX2_GPIO27_S    22
#define GPIO_GPAGMUX2_GPIO27_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO27
#define GPIO_GPAGMUX2_GPIO28_S    24
#define GPIO_GPAGMUX2_GPIO28_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO28
#define GPIO_GPAGMUX2_GPIO29_S    26
#define GPIO_GPAGMUX2_GPIO29_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO29
#define GPIO_GPAGMUX2_GPIO30_S    28
#define GPIO_GPAGMUX2_GPIO30_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO30
#define GPIO_GPAGMUX2_GPIO31_S    30
#define GPIO_GPAGMUX2_GPIO31_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO31

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACSEL1 register
//
//*****************************************************************************
#define GPIO_GPACSEL1_GPIO0_S     0
#define GPIO_GPACSEL1_GPIO0_M     0xF         // GPIO0 Master CPU Select
#define GPIO_GPACSEL1_GPIO1_S     4
#define GPIO_GPACSEL1_GPIO1_M     0xF0        // GPIO1 Master CPU Select
#define GPIO_GPACSEL1_GPIO2_S     8
#define GPIO_GPACSEL1_GPIO2_M     0xF00       // GPIO2 Master CPU Select
#define GPIO_GPACSEL1_GPIO3_S     12
#define GPIO_GPACSEL1_GPIO3_M     0xF000      // GPIO3 Master CPU Select
#define GPIO_GPACSEL1_GPIO4_S     16
#define GPIO_GPACSEL1_GPIO4_M     0xF0000     // GPIO4 Master CPU Select
#define GPIO_GPACSEL1_GPIO5_S     20
#define GPIO_GPACSEL1_GPIO5_M     0xF00000    // GPIO5 Master CPU Select
#define GPIO_GPACSEL1_GPIO6_S     24
#define GPIO_GPACSEL1_GPIO6_M     0xF000000   // GPIO6 Master CPU Select
#define GPIO_GPACSEL1_GPIO7_S     28
#define GPIO_GPACSEL1_GPIO7_M     0xF0000000  // GPIO7 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACSEL2 register
//
//*****************************************************************************
#define GPIO_GPACSEL2_GPIO8_S     0
#define GPIO_GPACSEL2_GPIO8_M     0xF         // GPIO8 Master CPU Select
#define GPIO_GPACSEL2_GPIO9_S     4
#define GPIO_GPACSEL2_GPIO9_M     0xF0        // GPIO9 Master CPU Select
#define GPIO_GPACSEL2_GPIO10_S    8
#define GPIO_GPACSEL2_GPIO10_M    0xF00       // GPIO10 Master CPU Select
#define GPIO_GPACSEL2_GPIO11_S    12
#define GPIO_GPACSEL2_GPIO11_M    0xF000      // GPIO11 Master CPU Select
#define GPIO_GPACSEL2_GPIO12_S    16
#define GPIO_GPACSEL2_GPIO12_M    0xF0000     // GPIO12 Master CPU Select
#define GPIO_GPACSEL2_GPIO13_S    20
#define GPIO_GPACSEL2_GPIO13_M    0xF00000    // GPIO13 Master CPU Select
#define GPIO_GPACSEL2_GPIO14_S    24
#define GPIO_GPACSEL2_GPIO14_M    0xF000000   // GPIO14 Master CPU Select
#define GPIO_GPACSEL2_GPIO15_S    28
#define GPIO_GPACSEL2_GPIO15_M    0xF0000000  // GPIO15 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACSEL3 register
//
//*****************************************************************************
#define GPIO_GPACSEL3_GPIO16_S    0
#define GPIO_GPACSEL3_GPIO16_M    0xF         // GPIO16 Master CPU Select
#define GPIO_GPACSEL3_GPIO17_S    4
#define GPIO_GPACSEL3_GPIO17_M    0xF0        // GPIO17 Master CPU Select
#define GPIO_GPACSEL3_GPIO18_S    8
#define GPIO_GPACSEL3_GPIO18_M    0xF00       // GPIO18 Master CPU Select
#define GPIO_GPACSEL3_GPIO19_S    12
#define GPIO_GPACSEL3_GPIO19_M    0xF000      // GPIO19 Master CPU Select
#define GPIO_GPACSEL3_GPIO20_S    16
#define GPIO_GPACSEL3_GPIO20_M    0xF0000     // GPIO20 Master CPU Select
#define GPIO_GPACSEL3_GPIO21_S    20
#define GPIO_GPACSEL3_GPIO21_M    0xF00000    // GPIO21 Master CPU Select
#define GPIO_GPACSEL3_GPIO22_S    24
#define GPIO_GPACSEL3_GPIO22_M    0xF000000   // GPIO22 Master CPU Select
#define GPIO_GPACSEL3_GPIO23_S    28
#define GPIO_GPACSEL3_GPIO23_M    0xF0000000  // GPIO23 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACSEL4 register
//
//*****************************************************************************
#define GPIO_GPACSEL4_GPIO24_S    0
#define GPIO_GPACSEL4_GPIO24_M    0xF         // GPIO24 Master CPU Select
#define GPIO_GPACSEL4_GPIO25_S    4
#define GPIO_GPACSEL4_GPIO25_M    0xF0        // GPIO25 Master CPU Select
#define GPIO_GPACSEL4_GPIO26_S    8
#define GPIO_GPACSEL4_GPIO26_M    0xF00       // GPIO26 Master CPU Select
#define GPIO_GPACSEL4_GPIO27_S    12
#define GPIO_GPACSEL4_GPIO27_M    0xF000      // GPIO27 Master CPU Select
#define GPIO_GPACSEL4_GPIO28_S    16
#define GPIO_GPACSEL4_GPIO28_M    0xF0000     // GPIO28 Master CPU Select
#define GPIO_GPACSEL4_GPIO29_S    20
#define GPIO_GPACSEL4_GPIO29_M    0xF00000    // GPIO29 Master CPU Select
#define GPIO_GPACSEL4_GPIO30_S    24
#define GPIO_GPACSEL4_GPIO30_M    0xF000000   // GPIO30 Master CPU Select
#define GPIO_GPACSEL4_GPIO31_S    28
#define GPIO_GPACSEL4_GPIO31_M    0xF0000000  // GPIO31 Master CPU Select

