AdrianoRuseler/LAUNCHXL-F28377S/C2000Ware/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPBGMUX2 register
//
//*****************************************************************************
#define GPIO_GPBGMUX2_GPIO48_S    0
#define GPIO_GPBGMUX2_GPIO48_M    0x3         // Defines pin-muxing selection
                                              // for GPIO48
#define GPIO_GPBGMUX2_GPIO49_S    2
#define GPIO_GPBGMUX2_GPIO49_M    0xC         // Defines pin-muxing selection
                                              // for GPIO49
#define GPIO_GPBGMUX2_GPIO50_S    4
#define GPIO_GPBGMUX2_GPIO50_M    0x30        // Defines pin-muxing selection
                                              // for GPIO50
#define GPIO_GPBGMUX2_GPIO51_S    6
#define GPIO_GPBGMUX2_GPIO51_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO51
#define GPIO_GPBGMUX2_GPIO52_S    8
#define GPIO_GPBGMUX2_GPIO52_M    0x300       // Defines pin-muxing selection
                                              // for GPIO52
#define GPIO_GPBGMUX2_GPIO53_S    10
#define GPIO_GPBGMUX2_GPIO53_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO53
#define GPIO_GPBGMUX2_GPIO54_S    12
#define GPIO_GPBGMUX2_GPIO54_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO54
#define GPIO_GPBGMUX2_GPIO55_S    14
#define GPIO_GPBGMUX2_GPIO55_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO55
#define GPIO_GPBGMUX2_GPIO56_S    16
#define GPIO_GPBGMUX2_GPIO56_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO56
#define GPIO_GPBGMUX2_GPIO57_S    18
#define GPIO_GPBGMUX2_GPIO57_M    0xC0000     // Defines pin-muxing selection
                                              // for GPIO57
#define GPIO_GPBGMUX2_GPIO58_S    20
#define GPIO_GPBGMUX2_GPIO58_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO58
#define GPIO_GPBGMUX2_GPIO59_S    22
#define GPIO_GPBGMUX2_GPIO59_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO59
#define GPIO_GPBGMUX2_GPIO60_S    24
#define GPIO_GPBGMUX2_GPIO60_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO60
#define GPIO_GPBGMUX2_GPIO61_S    26
#define GPIO_GPBGMUX2_GPIO61_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO61
#define GPIO_GPBGMUX2_GPIO62_S    28
#define GPIO_GPBGMUX2_GPIO62_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO62
#define GPIO_GPBGMUX2_GPIO63_S    30
#define GPIO_GPBGMUX2_GPIO63_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO63

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL1 register
//
//*****************************************************************************
#define GPIO_GPBCSEL1_GPIO32_S    0
#define GPIO_GPBCSEL1_GPIO32_M    0xF         // GPIO32 Master CPU Select
#define GPIO_GPBCSEL1_GPIO33_S    4
#define GPIO_GPBCSEL1_GPIO33_M    0xF0        // GPIO33 Master CPU Select
#define GPIO_GPBCSEL1_GPIO34_S    8
#define GPIO_GPBCSEL1_GPIO34_M    0xF00       // GPIO34 Master CPU Select
#define GPIO_GPBCSEL1_GPIO35_S    12
#define GPIO_GPBCSEL1_GPIO35_M    0xF000      // GPIO35 Master CPU Select
#define GPIO_GPBCSEL1_GPIO36_S    16
#define GPIO_GPBCSEL1_GPIO36_M    0xF0000     // GPIO36 Master CPU Select
#define GPIO_GPBCSEL1_GPIO37_S    20
#define GPIO_GPBCSEL1_GPIO37_M    0xF00000    // GPIO37 Master CPU Select
#define GPIO_GPBCSEL1_GPIO38_S    24
#define GPIO_GPBCSEL1_GPIO38_M    0xF000000   // GPIO38 Master CPU Select
#define GPIO_GPBCSEL1_GPIO39_S    28
#define GPIO_GPBCSEL1_GPIO39_M    0xF0000000  // GPIO39 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL2 register
//
//*****************************************************************************
#define GPIO_GPBCSEL2_GPIO40_S    0
#define GPIO_GPBCSEL2_GPIO40_M    0xF         // GPIO40 Master CPU Select
#define GPIO_GPBCSEL2_GPIO41_S    4
#define GPIO_GPBCSEL2_GPIO41_M    0xF0        // GPIO41 Master CPU Select
#define GPIO_GPBCSEL2_GPIO42_S    8
#define GPIO_GPBCSEL2_GPIO42_M    0xF00       // GPIO42 Master CPU Select
#define GPIO_GPBCSEL2_GPIO43_S    12
#define GPIO_GPBCSEL2_GPIO43_M    0xF000      // GPIO43 Master CPU Select
#define GPIO_GPBCSEL2_GPIO44_S    16
#define GPIO_GPBCSEL2_GPIO44_M    0xF0000     // GPIO44 Master CPU Select
#define GPIO_GPBCSEL2_GPIO45_S    20
#define GPIO_GPBCSEL2_GPIO45_M    0xF00000    // GPIO45 Master CPU Select
#define GPIO_GPBCSEL2_GPIO46_S    24
#define GPIO_GPBCSEL2_GPIO46_M    0xF000000   // GPIO46 Master CPU Select
#define GPIO_GPBCSEL2_GPIO47_S    28
#define GPIO_GPBCSEL2_GPIO47_M    0xF0000000  // GPIO47 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL3 register
//
//*****************************************************************************
#define GPIO_GPBCSEL3_GPIO48_S    0
#define GPIO_GPBCSEL3_GPIO48_M    0xF         // GPIO48 Master CPU Select
#define GPIO_GPBCSEL3_GPIO49_S    4
#define GPIO_GPBCSEL3_GPIO49_M    0xF0        // GPIO49 Master CPU Select
#define GPIO_GPBCSEL3_GPIO50_S    8
#define GPIO_GPBCSEL3_GPIO50_M    0xF00       // GPIO50 Master CPU Select
#define GPIO_GPBCSEL3_GPIO51_S    12
#define GPIO_GPBCSEL3_GPIO51_M    0xF000      // GPIO51 Master CPU Select
#define GPIO_GPBCSEL3_GPIO52_S    16
#define GPIO_GPBCSEL3_GPIO52_M    0xF0000     // GPIO52 Master CPU Select
#define GPIO_GPBCSEL3_GPIO53_S    20
#define GPIO_GPBCSEL3_GPIO53_M    0xF00000    // GPIO53 Master CPU Select
#define GPIO_GPBCSEL3_GPIO54_S    24
#define GPIO_GPBCSEL3_GPIO54_M    0xF000000   // GPIO54 Master CPU Select
#define GPIO_GPBCSEL3_GPIO55_S    28
#define GPIO_GPBCSEL3_GPIO55_M    0xF0000000  // GPIO55 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL4 register
//
//*****************************************************************************
#define GPIO_GPBCSEL4_GPIO56_S    0
#define GPIO_GPBCSEL4_GPIO56_M    0xF         // GPIO56 Master CPU Select
#define GPIO_GPBCSEL4_GPIO57_S    4
#define GPIO_GPBCSEL4_GPIO57_M    0xF0        // GPIO57 Master CPU Select
#define GPIO_GPBCSEL4_GPIO58_S    8
#define GPIO_GPBCSEL4_GPIO58_M    0xF00       // GPIO58 Master CPU Select
#define GPIO_GPBCSEL4_GPIO59_S    12
#define GPIO_GPBCSEL4_GPIO59_M    0xF000      // GPIO59 Master CPU Select
#define GPIO_GPBCSEL4_GPIO60_S    16
#define GPIO_GPBCSEL4_GPIO60_M    0xF0000     // GPIO60 Master CPU Select
#define GPIO_GPBCSEL4_GPIO61_S    20
#define GPIO_GPBCSEL4_GPIO61_M    0xF00000    // GPIO61 Master CPU Select
#define GPIO_GPBCSEL4_GPIO62_S    24
#define GPIO_GPBCSEL4_GPIO62_M    0xF000000   // GPIO62 Master CPU Select
#define GPIO_GPBCSEL4_GPIO63_S    28
#define GPIO_GPBCSEL4_GPIO63_M    0xF0000000  // GPIO63 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBLOCK register
//
//*****************************************************************************
#define GPIO_GPBLOCK_GPIO32       0x1         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO33       0x2         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO34       0x4         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO35       0x8         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO36       0x10        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO37       0x20        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO38       0x40        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO39       0x80        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO40       0x100       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO41       0x200       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO42       0x400       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO43       0x800       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO44       0x1000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO45       0x2000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO46       0x4000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO47       0x8000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO48       0x10000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO49       0x20000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO50       0x40000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO51       0x80000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO52       0x100000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO53       0x200000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO54       0x400000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO55       0x800000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO56       0x1000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO57       0x2000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO58       0x4000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO59       0x8000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO60       0x10000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO61       0x20000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO62       0x40000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO63       0x80000000  // Configuration Lock bit for this
                                              // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCR register
//
//*****************************************************************************
#define GPIO_GPBCR_GPIO32         0x1         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO33         0x2         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO34         0x4         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO35         0x8         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO36         0x10        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO37         0x20        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO38         0x40        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO39         0x80        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO40         0x100       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO41         0x200       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO42         0x400       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO43         0x800       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO44         0x1000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO45         0x2000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO46         0x4000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO47         0x8000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO48         0x10000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO49         0x20000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO50         0x40000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO51         0x80000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO52         0x100000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO53         0x200000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO54         0x400000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO55         0x800000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO56         0x1000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO57         0x2000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO58         0x4000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO59         0x8000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO60         0x10000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO61         0x20000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO62         0x40000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO63         0x80000000  // Configuration lock commit bit
                                              // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCTRL register
//
//*****************************************************************************
#define GPIO_GPCCTRL_QUALPRD0_S   0
#define GPIO_GPCCTRL_QUALPRD0_M   0xFF        // Qualification sampling period
                                              // for GPIO64 to GPIO71
#define GPIO_GPCCTRL_QUALPRD1_S   8
#define GPIO_GPCCTRL_QUALPRD1_M   0xFF00      // Qualification sampling period
                                              // for GPIO72 to GPIO79
#define GPIO_GPCCTRL_QUALPRD2_S   16
#define GPIO_GPCCTRL_QUALPRD2_M   0xFF0000    // Qualification sampling period
                                              // for GPIO80 to GPIO87
#define GPIO_GPCCTRL_QUALPRD3_S   24
#define GPIO_GPCCTRL_QUALPRD3_M   0xFF000000  // Qualification sampling period
                                              // for GPIO88 to GPIO95

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCQSEL1 register
//
//*****************************************************************************
#define GPIO_GPCQSEL1_GPIO64_S    0
#define GPIO_GPCQSEL1_GPIO64_M    0x3         // Select input qualification type
                                              // for GPIO64
#define GPIO_GPCQSEL1_GPIO65_S    2
#define GPIO_GPCQSEL1_GPIO65_M    0xC         // Select input qualification type
                                              // for GPIO65
#define GPIO_GPCQSEL1_GPIO66_S    4
#define GPIO_GPCQSEL1_GPIO66_M    0x30        // Select input qualification type
                                              // for GPIO66
#define GPIO_GPCQSEL1_GPIO67_S    6
#define GPIO_GPCQSEL1_GPIO67_M    0xC0        // Select input qualification type
                                              // for GPIO67
#define GPIO_GPCQSEL1_GPIO68_S    8
#define GPIO_GPCQSEL1_GPIO68_M    0x300       // Select input qualification type
                                              // for GPIO68
#define GPIO_GPCQSEL1_GPIO69_S    10
#define GPIO_GPCQSEL1_GPIO69_M    0xC00       // Select input qualification type
                                              // for GPIO69
#define GPIO_GPCQSEL1_GPIO70_S    12
#define GPIO_GPCQSEL1_GPIO70_M    0x3000      // Select input qualification type
                                              // for GPIO70
#define GPIO_GPCQSEL1_GPIO71_S    14
#define GPIO_GPCQSEL1_GPIO71_M    0xC000      // Select input qualification type
                                              // for GPIO71
#define GPIO_GPCQSEL1_GPIO72_S    16
#define GPIO_GPCQSEL1_GPIO72_M    0x30000     // Select input qualification type
                                              // for GPIO72
#define GPIO_GPCQSEL1_GPIO73_S    18
#define GPIO_GPCQSEL1_GPIO73_M    0xC0000     // Select input qualification type
                                              // for GPIO73
#define GPIO_GPCQSEL1_GPIO74_S    20
#define GPIO_GPCQSEL1_GPIO74_M    0x300000    // Select input qualification type
                                              // for GPIO74
#define GPIO_GPCQSEL1_GPIO75_S    22
#define GPIO_GPCQSEL1_GPIO75_M    0xC00000    // Select input qualification type
                                              // for GPIO75
#define GPIO_GPCQSEL1_GPIO76_S    24
#define GPIO_GPCQSEL1_GPIO76_M    0x3000000   // Select input qualification type
                                              // for GPIO76
#define GPIO_GPCQSEL1_GPIO77_S    26
#define GPIO_GPCQSEL1_GPIO77_M    0xC000000   // Select input qualification type
                                              // for GPIO77
#define GPIO_GPCQSEL1_GPIO78_S    28
#define GPIO_GPCQSEL1_GPIO78_M    0x30000000  // Select input qualification type
                                              // for GPIO78
#define GPIO_GPCQSEL1_GPIO79_S    30
#define GPIO_GPCQSEL1_GPIO79_M    0xC0000000  // Select input qualification type
                                              // for GPIO79

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCQSEL2 register
//
//*****************************************************************************
#define GPIO_GPCQSEL2_GPIO80_S    0
#define GPIO_GPCQSEL2_GPIO80_M    0x3         // Select input qualification type
                                              // for GPIO80
#define GPIO_GPCQSEL2_GPIO81_S    2
#define GPIO_GPCQSEL2_GPIO81_M    0xC         // Select input qualification type
                                              // for GPIO81
#define GPIO_GPCQSEL2_GPIO82_S    4
#define GPIO_GPCQSEL2_GPIO82_M    0x30        // Select input qualification type
                                              // for GPIO82
#define GPIO_GPCQSEL2_GPIO83_S    6
#define GPIO_GPCQSEL2_GPIO83_M    0xC0        // Select input qualification type
                                              // for GPIO83
#define GPIO_GPCQSEL2_GPIO84_S    8
#define GPIO_GPCQSEL2_GPIO84_M    0x300       // Select input qualification type
                                              // for GPIO84
#define GPIO_GPCQSEL2_GPIO85_S    10
#define GPIO_GPCQSEL2_GPIO85_M    0xC00       // Select input qualification type
                                              // for GPIO85
#define GPIO_GPCQSEL2_GPIO86_S    12
#define GPIO_GPCQSEL2_GPIO86_M    0x3000      // Select input qualification type
                                              // for GPIO86
#define GPIO_GPCQSEL2_GPIO87_S    14
#define GPIO_GPCQSEL2_GPIO87_M    0xC000      // Select input qualification type
                                              // for GPIO87
#define GPIO_GPCQSEL2_GPIO88_S    16
#define GPIO_GPCQSEL2_GPIO88_M    0x30000     // Select input qualification type
                                              // for GPIO88
#define GPIO_GPCQSEL2_GPIO89_S    18
#define GPIO_GPCQSEL2_GPIO89_M    0xC0000     // Select input qualification type
                                              // for GPIO89
#define GPIO_GPCQSEL2_GPIO90_S    20
#define GPIO_GPCQSEL2_GPIO90_M    0x300000    // Select input qualification type
                                              // for GPIO90
#define GPIO_GPCQSEL2_GPIO91_S    22
#define GPIO_GPCQSEL2_GPIO91_M    0xC00000    // Select input qualification type
                                              // for GPIO91
#define GPIO_GPCQSEL2_GPIO92_S    24
#define GPIO_GPCQSEL2_GPIO92_M    0x3000000   // Select input qualification type
                                              // for GPIO92
#define GPIO_GPCQSEL2_GPIO93_S    26
#define GPIO_GPCQSEL2_GPIO93_M    0xC000000   // Select input qualification type
                                              // for GPIO93
#define GPIO_GPCQSEL2_GPIO94_S    28
#define GPIO_GPCQSEL2_GPIO94_M    0x30000000  // Select input qualification type
                                              // for GPIO94
#define GPIO_GPCQSEL2_GPIO95_S    30
#define GPIO_GPCQSEL2_GPIO95_M    0xC0000000  // Select input qualification type
                                              // for GPIO95

