AdrianoRuseler/LAUNCHXL-F28377S/C2000Ware/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCLEAR register
//
//*****************************************************************************
#define GPIO_GPFCLEAR_GPIO160     0x1         // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO161     0x2         // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO162     0x4         // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO163     0x8         // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO164     0x10        // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO165     0x20        // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO166     0x40        // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO167     0x80        // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO168     0x100       // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFTOGGLE register
//
//*****************************************************************************
#define GPIO_GPFTOGGLE_GPIO160    0x1         // Output Toggle bit for this pin
#define GPIO_GPFTOGGLE_GPIO161    0x2         // Output Toggle bit for this pin
#define GPIO_GPFTOGGLE_GPIO162    0x4         // Output Toggle bit for this pin
#define GPIO_GPFTOGGLE_GPIO163    0x8         // Output Toggle bit for this pin
#define GPIO_GPFTOGGLE_GPIO164    0x10        // Output Toggle bit for this pin
#define GPIO_GPFTOGGLE_GPIO165    0x20        // Output Toggle bit for this pin
#define GPIO_GPFTOGGLE_GPIO166    0x40        // Output Toggle bit for this pin
#define GPIO_GPFTOGGLE_GPIO167    0x80        // Output Toggle bit for this pin
#define GPIO_GPFTOGGLE_GPIO168    0x100       // Output Toggle bit for this pin
#endif
